import Cover from "../../../Components/js/Cover"

export const metadata = {
    title: ".com",
    description: "Домен .com"
};
export default function Com(){
    return (
        <div>
            <Cover title="Все о Программировании" namePage=".com" image="/allIt.jpg" isShowBtn={false}/>
            <div className="text">
                <q>Доменное имя .com — домен верхнего уровня (TLD) в системе доменных имён интернет-сети. Его название происходит от слова «коммерческий», указывая на его первоначальное предназначение — домены, зарегистрированные коммерческими организациями. Однако в какой-то момент это различие было потеряно, когда домены .com, .org и .net были открыты для неограниченной регистрации.<br/><br/>

                Домен, первоначально находившийся под управлением Министерства обороны Соединённых Штатов, сегодня администрируется Verisign. Регистрация доменов .com, выполняемая Verisign, обрабатывается аккредитованными регистраторами ICANN. Реестр допускает использование интернационализованных доменных имён.<br/><br/>

                Домен является одним из первых доменов верхнего уровня (TLD) в интернете, появившихся вместе с внедрением системы доменных имен в январе 1985 года, вместе с .edu, .gov, .mil, .net, .org и .arpa. Он стал крупнейшим доменом верхнего уровня.</q>
                <br/>
                <h2>История</h2>
                <p>Удали заметки: Домен .com был одним из первых доменов верхнего уровня на момент внедрения системы доменных имен для использования в интернете в январе 1985 года. Домен управлялся Министерством обороны США (DoD), однако Министерство передало управление доменом компании SRI International, создавшей центр DDN-NIC, также известный как SRI-NIC или просто NIC (Network Information Center — сетевой информационный центр), доступный в интернете под доменным именем nic.ddn.mil. Начиная с 1 октября 1991 года был заключен контракт на работы с компанией Government Systems Inc. (GSI), которая заключила субконтракт с Network Solutions Inc. (NSI).<br/><br/>

                Первый домен в зоне .com появился 15 марта 1985 года, он был зарегистрирован в американском штате Массачусетс. Им стал сайт компании Symbolics Inc., производящей компьютеры и программное обеспечение. По состоянию на ноябрь 2021 года, доменное имя принадлежит частному лицу (Aron Meystedt) и недоступно для покупки.<br/><br/>

                1 января 1993 года ответственность за обслуживание взял на себя Национальный научный фонд, так как домен .com в основном использовался для гражданских целей. ННФ заключил контракт на проведение работ с Network Solutions (NSI). В 1995 году ННФ уполномочил NSI начать взимать с регистрантов ежегодную абонентскую плату, впервые с момента внедрения системы доменов. Первоначально плата составляла $50 в год, из которых $35 отходили NSI и $15 поступали в государственный фонд. При регистрации новых доменов плата взималась за первые два года; таким образом, при регистрации нового домена следовало уплатить $100. В 1997 году Министерство торговли Соединённых Штатов взяло на себя управление всеми общими доменами верхнего уровня. В настоящее время функциями управления занимается компания Verisign, поглотившая компанию Network Solutions. Позднее, Verisign отделила функции Network Solutions, не связанные с регистрацией, в отдельную компанию, которая продолжает действовать в качестве регистратора. В английском языке домен часто произносится как «dot-com» вместе с предшествующей точкой; такое его название прочно вошло в обиход.<br/><br/>

                Хотя домены .com были первоначально предназначены для обозначения коммерческих организаций (другие домены верхнего уровня относятся к государственным и образовательным учреждениям), с середины 1990-х годов отсутствуют какие-либо ограничения относительно деятельности регистрантов доменов .com. С коммерциализацией и популяризацией интернета домен .com был открыт для общественности и быстро стал наиболее распространенным доменом верхнего уровня для веб-сайтов, электронной почты и сетей. Многие компании, расцвет которых пришелся на период с 1997 по 2001 год (в так называемые времена «пузыря доткомов»), включали суффикс .com в название компании; они известны как «доткомы» или «компании доткомы». Введение в 2001 году домена .biz, ограниченного предприятиями, не повлияло на популярность .com.<br/><br/>

                Хотя домены .com могут зарегистрировать компании в любой точке мира, во многих странах для аналогичных целей предусмотрены домены второго уровня, расположенные под национальным доменом верхнего уровня (ccTLD). Такие домены второго уровня обычно имеют формат com.xx или co.xx, где xx — это национальный домен верхнего уровня. Примерами таких доменов могут служить Австралия (.com.au), Шри-Ланка (.com.lk), Греция (.com.gr), Мексика (.com.mx), Южная Корея (.co.kr), Индия (.co.in), Индонезия (.co.id), Китай (.com.cn), Япония (.co.jp) и Великобритания (.co.uk).<br/><br/>

                Многие некоммерческие сайты и сети используют имена com, чтобы воспользоваться преимуществами узнавания домена com. Однако статистика регистрации показывает переменную популярность.<br/><br/>

                По состоянию на декабрь 2011 года компания Verisign сообщила о том, что зарегистрировано около 100 миллионов доменов .com. В марте 2009 года компания Verisign сообщила о том, что домен обслуживается 926 аккредитованными регистраторами.<br/><br/>
                
                За первые два года — до 1987 года — во всемирной паутине появилось лишь 100 сайтов. Однако уже к 1995 году в доменной зоне .com было зарегистрировано свыше 18 тыс. сайтов. В марте 2010 года в домене .com было зарегистрировано 84 миллиона сайтов, в том числе 11,9 миллиона сайтов, специализирующихся на торговле через сеть, 4,3 миллиона развлекательных сайтов, 3,1 миллиона сайтов, связанных с различными финансовыми операциями, и 1,8 миллиона сайтов со спортивной направленностью.</p>
                <br/>
                <h2>Домены</h2>
                <p>15 мая 2000 года закончились все свободные трёхсимвольные домены.<br/>
                4 ноября 2007 года закончились все свободные четырёхбуквенные домены.</p>
                <br/>
                <h2>Список самых старых доменов</h2>
                <table>
                    <thead>
                        <tr>
                            <th>№</th>
                            <th>Домен</th>
                            <th>Год</th>
                        </tr>
                    </thead>
                    <tbody>
                        <tr>
                            <td>1</td>
                            <td>symbolics.com</td>
                            <td>1985</td>
                        </tr>
                        <tr>
                            <td>2</td>
                            <td>bbn.com</td>
                            <td>1985</td>
                        </tr>
                        <tr>
                            <td>3</td>
                            <td>think.com</td>
                            <td>1985</td>
                        </tr>
                        <tr>
                            <td>4</td>
                            <td>mcc.com</td>
                            <td>1985</td>
                        </tr>
                        <tr>
                            <td>5</td>
                            <td>dec.com</td>
                            <td>1985</td>
                        </tr>
                        <tr>
                            <td>6</td>
                            <td>northrop.com</td>
                            <td>1985</td>
                        </tr>
                        <tr>
                            <td>7</td>
                            <td>xerox.com</td>
                            <td>1986</td>
                        </tr>
                        <tr>
                            <td>8</td>
                            <td>sri.com</td>
                            <td>1986</td>
                        </tr>
                        <tr>
                            <td>9</td>
                            <td>hp.com</td>
                            <td>1986</td>
                        </tr>
                        <tr>
                            <td>10</td>
                            <td>bellcore.com</td>
                            <td>1986</td>
                        </tr>
                    </tbody>
                </table>
            </div>
        </div>
    )
}